#include <stdio.h>
#include <cs50.h>

int main() {
    int height;

    // Запитуємо висоту, поки не отримаємо правильне значення
    do {
        height = get_int("Height: "); //Запитуємо висоту у користувача
    } while (height < 1 || height > 8); // Повторюємо, якщо висота не в діапазоні від 1 до 8

    // Генерація піраміди
    for (int i = 1; i <= height; i++) { // Повторення кожного рівня піраміди 
        for (int j = 0; j < height - i; j++) { // Зменшення пробілів на кожному рівні
            printf(" ");
        }
        for (int k = 0; k < i; k++) { // Збільшення хешів на кожному рівні
            printf("#");
        }
        printf("\n"); // Перехід на новий рядок після кожного рівня піраміди
    }

    return 0;
}

